import React, { useState } from "react";
import {
  IonContent, IonPage, IonHeader, IonToolbar,
  IonTitle, IonButtons, IonBackButton, IonToggle,
  IonSpinner
} from '@ionic/react';
import { Chart } from 'react-google-charts';

const JiangxiRiverWarning: React.FC = () => {
  const [checked, setChecked] = useState(false);
  return (
    <IonPage>
      <IonHeader>
        <IonToolbar>
          <IonButtons slot="start">
            <IonBackButton defaultHref="/" />
          </IonButtons>
          <IonTitle>江西省｜中小河流洪水预警</IonTitle>
          <IonButtons slot="end">
            <IonToggle color="primary" checked={checked} onIonChange={e => setChecked(e.detail.checked)} />
          </IonButtons>
        </IonToolbar>
      </IonHeader>
      <IonContent fullscreen forceOverscroll scrollY={false}>
        <Chart
          width={'100%'}
          height={'100%'}
          chartType="Table"
          loader={<div style={{ textAlign: "center", position: "absolute", left: 0, right: 0, top: "50%" }}><IonSpinner /></div>}
          data={[
            [
              { type: 'string', label: '县名' },
              { type: 'string', label: '详细地址' },
              { type: 'string', label: '站名' },
              { type: 'string', label: '小计雨量' },
              { type: 'string', label: '20200709 06-07' },
              { type: 'string', label: '20200709 07-08' },
              { type: 'string', label: '20200709 08-09' },
              { type: 'string', label: '20200709 09-10' },
              { type: 'string', label: '20200709 10-11' },
              { type: 'string', label: '20200709 11-12' },
              { type: 'string', label: '20200709 12-13' },
              { type: 'string', label: '20200709 13-14' },
              { type: 'string', label: '20200709 14-15' },
              { type: 'string', label: '20200709 15-16' },
              { type: 'string', label: '20200709 16-17' },
              { type: 'string', label: '20200709 17-18' },
              { type: 'string', label: '20200709 18-19' },
            ],
            ['总计', '', '', '52516.70', '2533.90', '2575.4', '0', '3097.5', '3882.2', '1921.5', '2032', '2729.5', '2469.5', '2486.5', '2095.5', '3080', '3089'],
            ['丰城市', '宜春市丰城市泉港镇潭埠村', '长岭岗水库', '30.20', '30.20', '', '', '', '38.4', '', '', '', '38', '', '', '', ''],
            ['安福县', '吉安市安福县严田镇', '邵家', '30.5', '', '', '', '33.00', '', '', '', '', '30.5', '', '', '', ''],
            ['分宜县', '新余市分宜县操场乡政府', '操场', '30.5', '', '', '', '', '', '38.4', '', '', '', '', '35.20', '', ''],
            ['分宜县', '新余市分宜县钤山镇苑坑', '苑坑', '30.5', '', '', '', '30.5', '', '', '', '', '', '', '', '', ''],
            ['高安市', '高安市蓝坊镇先岗村', '凉亭水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['安源区', '安源区安源镇茶亭村', '茶亭', '58', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['吉安县', '吉安市吉安县敖城镇版塘村', '石门水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['丰城市', '宜春市丰城市泉港镇潭埠村', '长岭岗水库', '30.20', '30.20', '', '', '', '38.4', '', '', '', '38', '', '', '', ''],
            ['安福县', '吉安市安福县严田镇', '邵家', '30.5', '', '', '', '33.00', '', '', '', '', '30.5', '', '', '', ''],
            ['分宜县', '新余市分宜县操场乡政府', '操场', '30.5', '', '', '', '', '', '38.4', '', '', '', '', '35.20', '', ''],
            ['分宜县', '新余市分宜县钤山镇苑坑', '苑坑', '30.5', '', '', '', '30.5', '', '', '', '', '', '', '', '', ''],
            ['高安市', '高安市蓝坊镇先岗村', '凉亭水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['安源区', '安源区安源镇茶亭村', '茶亭', '58', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['吉安县', '吉安市吉安县敖城镇版塘村', '石门水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['丰城市', '宜春市丰城市泉港镇潭埠村', '长岭岗水库', '30.20', '30.20', '', '', '', '38.4', '', '', '', '38', '', '', '', ''],
            ['安福县', '吉安市安福县严田镇', '邵家', '30.5', '', '', '', '33.00', '', '', '', '', '30.5', '', '', '', ''],
            ['分宜县', '新余市分宜县操场乡政府', '操场', '30.5', '', '', '', '', '', '38.4', '', '', '', '', '35.20', '', ''],
            ['分宜县', '新余市分宜县钤山镇苑坑', '苑坑', '30.5', '', '', '', '30.5', '', '', '', '', '', '', '', '', ''],
            ['高安市', '高安市蓝坊镇先岗村', '凉亭水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['安源区', '安源区安源镇茶亭村', '茶亭', '58', '', '', '', '', '', '', '', '', '', '', '', '', ''],
            ['吉安县', '吉安市吉安县敖城镇版塘村', '石门水库', '30.5', '', '', '', '', '', '', '', '', '', '', '', '', ''],
          ]}
          options={{
            showRowNumber: true,
          }}
          rootProps={{ 'data-testid': '1' }}
        />
      </IonContent>
    </IonPage>
  );
};

export default JiangxiRiverWarning;


